
<details><summary>Show Plan</summary>

``` terraform
terraform
module.lambda.null_resource.docker_build: Refreshing state... [id=3063187375799499628]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z03799832ACKUNJ8IZDHB]
module.lambda.aws_s3_bucket.b: Refreshing state... [id=modl-test-data]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-modl-server-access-logs]
module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-hello_world]
module.lambda.null_resource.docker_tag: Refreshing state... [id=1297220926953226282]
module.lambda.null_resource.docker_push: Refreshing state... [id=2739680809221641621]
module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-hello-lambda-logs]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_www_CNAME]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"]: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__57b523665a1e9e3baef95f3dc85315ae.curibio-modl.com._CNAME]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_TXT]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_MX]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_862laeb5r7tfnxngc2mc_CNAME]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_A]
module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-hello-lambda]
module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=modl-hello-lambda-logs]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-16 22:33:28 +0000 UTC]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1CI0FY7D89ZVE]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_downloads.curibio-modl.com_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.downloads[0].aws_iam_role.downloads_role will be created
  + resource "aws_iam_role" "downloads_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {}
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::424924102580:root"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "s3_downloads_role"
      + path                  = "/"
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.downloads[0].aws_iam_role_policy.s3_downloads will be created
  + resource "aws_iam_role_policy" "s3_downloads" {
      + id     = (known after apply)
      + name   = "s3_downloads_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::downloads.curibio-modl.com"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObjectAcl",
                          + "s3:GetBucketObjectLockConfiguration",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetBucketVersioning",
                          + "s3:GetBucketAcl",
                          + "s3:GetObjectTorrent",
                          + "s3:GetBucketCORS",
                          + "s3:GetBucketLocation",
                          + "s3:GetObjectVersion",
                          + "s3:GetBucketRequestPayment",
                          + "s3:GetObjectTagging",
                          + "s3:GetMetricsConfiguration",
                          + "s3:GetBucketPublicAccessBlock",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:DeleteObjectVersion",
                          + "s3:GetBucketLogging",
                          + "s3:ListBucketVersions",
                          + "s3:GetAnalyticsConfiguration",
                          + "s3:GetObjectVersionForReplication",
                          + "s3:GetLifecycleConfiguration",
                          + "s3:ListBucketByTags",
                          + "s3:GetInventoryConfiguration",
                          + "s3:GetBucketTagging",
                          + "s3:PutObject",
                          + "s3:PutObjectAcl",
                          + "s3:GetObject",
                          + "s3:GetObjectVersionTagging",
                          + "s3:GetObjectAcl",
                          + "s3:GetBucketObjectLockConfiguration",
                          + "s3:GetObjectVersionAcl",
                          + "s3:PutObjectTagging",
                          + "s3:DeleteObject",
                          + "s3:DeleteObjectTagging",
                          + "s3:GetBucketPolicyStatus",
                          + "s3:GetObjectRetention",
                          + "s3:GetBucketWebsite",
                          + "s3:DeleteObjectVersionTagging",
                          + "s3:GetObjectLegalHold",
                          + "s3:GetBucketNotification",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::downloads.curibio-modl.com/*"
                    },
                  + {
                      + Action   = [
                          + "cloudfront:CreateInvalidation",
                          + "cloudfront:GetInvalidation",
                          + "cloudfront:ListInvalidations",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:cloudfront::725604423866:distribution/E1CI0FY7D89ZVE"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.downloads[0].aws_s3_bucket_policy.downloads_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "downloads_policy" {
        id     = "downloads.curibio-modl.com"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "s3:GetObject" -> [
                          + "s3:GetObject",
                        ]
                        # (4 unchanged elements hidden)
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::424924102580:user/s3_test"
                        }
                      - Resource  = "arn:aws:s3:::downloads.curibio-modl.com"
                    },
                  - {
                      - Action    = [
                          - "s3:GetObjectAcl",
                          - "s3:PutObject",
                          - "s3:PutObjectAcl",
                          - "s3:DeleteObject",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::424924102580:user/s3_test"
                        }
                      - Resource  = "arn:aws:s3:::downloads.curibio-modl.com/*"
                    },
                ]
                # (2 unchanged elements hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```

</details>

Pusher: @jperson